problems/+demirdzic/@PlateHole/meshes/plateHoleTwoblocks10x10/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.5 0 0)
    (2 0 0)
    (2 2 0)
    (0.3536 0.3536 0)
    (0.5 0 1)
    (2 0 1)
    (2 2 1)
    (0.3536 0.3536 1)
    (0 0.5 0)
    (0 2 0)
    (0 0.5 1)
    (0 2 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 1) simpleGrading (5 1 1)
    hex (8 3 2 9 10 7 6 11) (10 10 1) simpleGrading (1 5 1)
);

edges 
( 
    arc 0 3 (0.4619 0.1913 0) 
    arc 4 7 (0.4619 0.1913 1) 
    arc 3 8 (0.1913 0.4619 0)
    arc 7 10 (0.1913 0.4619 1)
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (9 2 6 11)
        );
    }

    hole
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (3 8 10 7)
        );
    }

    left
    {
        type wall;
        faces
        (
            (8 9 11 10)
        );
    }
    
    right
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (8 3 2 9)
            (10 7 6 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
