problems/+demirdzic/@PlateHole/meshes/plateHoleTwoblocks10x10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        nFaces          10;
        startFace       370;
    }
    hole
    {
        type            wall;
        nFaces          20;
        startFace       380;
    }
    left
    {
        type            wall;
        nFaces          10;
        startFace       400;
    }
    right
    {
        type            wall;
        nFaces          10;
        startFace       410;
    }
    bottom
    {
        type            wall;
        nFaces          10;
        startFace       420;
    }
    frontAndBack
    {
        type            empty;
        nFaces          400;
        startFace       430;
    }
)


// ************************************************************************* //
